app/controllers/coaches_controller.rb

  def index
    @coaches = Coach.all
---
SELECT "coaches".* FROM "coaches"

  def update
    respond_to do |format|
      if @coach.update(coach_params)
---
UPDATE "coaches" SET "phone" = $1, "updated_at" = $2 WHERE "coaches"."id" = $3  [["phone", "312-307-3032"], ["updated_at", "2016-03-14 22:50:46.293046"], ["id", 1]]

    def set_coach
      @coach = Coach.find(params[:id])
---
SELECT  "coaches".* FROM "coaches" WHERE "coaches"."id" = $1 LIMIT 1  [["id", 1]]