app/controllers/hab_codes_controller.rb

  def index
    if params[:search]
      @assigned = HabCode.assigned(sort_terms, params[:search]).paginate(:per_page => 2, :page => params[:page])
---
SELECT  "hab_codes".* FROM "hab_codes" WHERE (assigned = 't' AND (first_name like '%Makena%' OR last_name like '%Makena%' OR code like '%Makena%' OR email like '%Makena%' ))  ORDER BY code asc LIMIT 2 OFFSET 0

  def update
    respond_to do |format|
      if @hab_code.update(hab_code_params)
---
UPDATE "hab_codes" SET "assigned" = $1, "completed" = $2, "updated_at" = $3 WHERE "hab_codes"."id" = $4  [["assigned", "t"], ["completed", "2016-03-18 15:16:00.000000"], ["updated_at", "2016-03-18 15:16:19.098160"], ["id", 3]]

    def set_hab_code
      @hab_code = HabCode.find(params[:id])
---
SELECT  "hab_codes".* FROM "hab_codes" WHERE "hab_codes"."id" = $1 LIMIT 1  [["id", 3]]